# Pandas教程
### 2017七月在线 Python数据分析基础课 julyedu.com
by 褚则伟

## 目录
- DataFrame

## 数据结构DataFrame
### 2017七月在线 Python数据分析基础课 julyedu.com

In [1]:
import pandas as pd
cities = {'Beijing': 55000, 'Shanghai': 60000, 'Shenzhen': 50000, 'Hangzhou': 20000, 'Guangzhou': 25000, 'Suzhou': None}
# apts = pd.Series(cities)
apts = pd.Series(cities, name="price")
apts

Beijing      55000.0
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Name: price, dtype: float64

In [2]:
cars = pd.Series({'Beijing': 300000, 'Shanghai': 400000, 'Shenzhen': 300000, \
                      'Tianjin': 200000, 'Guangzhou': 200000, 'Chongqing': 150000}, name="cars")
cars

Beijing      300000
Chongqing    150000
Guangzhou    200000
Shanghai     400000
Shenzhen     300000
Tianjin      200000
Name: cars, dtype: int64

In [3]:
df = pd.DataFrame({"apts": apts, "cars": cars})
df

              apts      cars
Beijing    55000.0  300000.0
Chongqing      NaN  150000.0
Guangzhou  25000.0  200000.0
Hangzhou   20000.0       NaN
Shanghai   60000.0  400000.0
Shenzhen   50000.0  300000.0
Suzhou         NaN       NaN
Tianjin        NaN  200000.0

In [11]:
print(df["cars"])
print(type(df["cars"]))

Beijing      300000.0
Chongqing    150000.0
Guangzhou    200000.0
Hangzhou          NaN
Shanghai     400000.0
Shenzhen     300000.0
Suzhou            NaN
Tianjin      200000.0
Name: cars, dtype: float64
<class 'pandas.core.series.Series'>

加入一个新的column,默认会broadcast

In [7]:
df["income"] = 20000

In [8]:
df

              apts      cars  income
Beijing    55000.0  300000.0   20000
Chongqing      NaN  150000.0   20000
Guangzhou  25000.0  200000.0   20000
Hangzhou   20000.0       NaN   20000
Shanghai   60000.0  400000.0   20000
Shenzhen   50000.0  300000.0   20000
Suzhou         NaN       NaN   20000
Tianjin        NaN  200000.0   20000

In [5]:
df["expense"] = df["apts"] * 100 + df["cars"]

In [13]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   20000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0
Shenzhen   50000.0  300000.0   20000  5300000.0
Suzhou         NaN       NaN   20000        NaN
Tianjin        NaN  200000.0   20000        NaN

DataFrame的行由index决定

In [14]:
df.index

Index(['Beijing', 'Chongqing', 'Guangzhou', 'Hangzhou', 'Shanghai', 'Shenzhen',
       'Suzhou', 'Tianjin'],
      dtype='object')

DataFrame的列由column names决定

In [18]:
print(df["apts"])

Beijing      55000.0
Chongqing        NaN
Guangzhou    25000.0
Hangzhou     20000.0
Shanghai     60000.0
Shenzhen     50000.0
Suzhou           NaN
Tianjin          NaN
Name: apts, dtype: float64

loc方法可以用index选中行

In [15]:
df.loc["Beijing"]

apts         55000.0
cars        300000.0
income       20000.0
expense    5800000.0
Name: Beijing, dtype: float64

In [21]:
df.loc[["Shanghai", "Hangzhou", "Suzhou"]]

             apts      cars  income    expense
Shanghai  60000.0  400000.0   20000  6400000.0
Hangzhou  20000.0       NaN   20000        NaN
Suzhou        NaN       NaN   20000        NaN

In [22]:
df.loc["Hangzhou":"Suzhou"]

             apts      cars  income    expense
Hangzhou  20000.0       NaN   20000        NaN
Shanghai  60000.0  400000.0   20000  6400000.0
Shenzhen  50000.0  300000.0   20000  5300000.0
Suzhou        NaN       NaN   20000        NaN

下面这种方法默认用来选列而不是选行

In [17]:
# df["Beijing"]

iloc方法可以用数字选中行

In [28]:
df.iloc[0:5]

              apts      cars  income    expense
Beijing    55000.0  300000.0   20000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0

行列一起选

In [31]:
df[["apts", "income"]].loc["Chongqing":"Shanghai"]

              apts  income
Chongqing      NaN   20000
Guangzhou  25000.0   20000
Hangzhou   20000.0   20000
Shanghai   60000.0   20000

In [32]:
df.ix[1:4, 1:3]

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

               cars  income
Chongqing  150000.0   20000
Guangzhou  200000.0   20000
Hangzhou        NaN   20000

### DataFrame元素赋值

In [35]:
df["income"].loc["Beijing"] = 30000

/Users/zeweichu/anaconda3/envs/py36/lib/python3.6/site-packages/pandas/core/indexing.py:179: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [36]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   30000  5800000.0
Chongqing      NaN  150000.0   20000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   20000        NaN
Shanghai   60000.0  400000.0   20000  6400000.0
Shenzhen   50000.0  300000.0   20000  5300000.0
Suzhou         NaN       NaN   20000        NaN
Tianjin        NaN  200000.0   20000        NaN

可以给一整列赋值

In [4]:
df["income"] = 15000

In [38]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

给一整行赋值

In [39]:
df.loc["Suzhou"] = 0
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         0.0       0.0       0        0.0
Tianjin        NaN  200000.0   15000        NaN

In [43]:
import numpy as np
df.income = np.arange(8)*10000

In [44]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0       0  5800000.0
Chongqing      NaN  150000.0   10000        NaN
Guangzhou  25000.0  200000.0   20000  2700000.0
Hangzhou   20000.0       NaN   30000        NaN
Shanghai   60000.0  400000.0   40000  6400000.0
Shenzhen   50000.0  300000.0   50000  5300000.0
Suzhou         0.0       0.0   60000        0.0
Tianjin        NaN  200000.0   70000        NaN

In [45]:
df.shape

(8, 4)

In [47]:
df.shape[1]

4

还可以用Series来指定需要修改的index以及相对应的value，没有指定的默认用NaN.

In [48]:
income = pd.Series([10000, 20000, 30000], index=["Chongqing", "Guangzhou", "Shenzhen"])
df.income = income
df

              apts      cars   income    expense
Beijing    55000.0  300000.0      NaN  5800000.0
Chongqing      NaN  150000.0  10000.0        NaN
Guangzhou  25000.0  200000.0  20000.0  2700000.0
Hangzhou   20000.0       NaN      NaN        NaN
Shanghai   60000.0  400000.0      NaN  6400000.0
Shenzhen   50000.0  300000.0  30000.0  5300000.0
Suzhou         0.0       0.0      NaN        0.0
Tianjin        NaN  200000.0      NaN        NaN

In [50]:
df["western"] = df.index == "Chongqing"

In [51]:
df

              apts      cars   income    expense  western
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False

In [52]:
df.columns

Index(['apts', 'cars', 'income', 'expense', 'western'], dtype='object')

In [53]:
df.index

Index(['Beijing', 'Chongqing', 'Guangzhou', 'Hangzhou', 'Shanghai', 'Shenzhen',
       'Suzhou', 'Tianjin'],
      dtype='object')

一个DataFrame就和一个numpy 2d array一样，可以被转置

In [54]:
df.T

         Beijing Chongqing Guangzhou Hangzhou Shanghai Shenzhen Suzhou Tianjin
apts       55000       NaN     25000    20000    60000    50000      0     NaN
cars      300000    150000    200000      NaN   400000   300000      0  200000
income       NaN     10000     20000      NaN      NaN    30000    NaN     NaN
expense  5.8e+06       NaN   2.7e+06      NaN  6.4e+06  5.3e+06      0     NaN
western    False      True     False    False    False    False  False   False

用info查看DataFrame的信息

In [55]:
df.info

<bound method DataFrame.info of               apts      cars   income    expense  western
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False>

我们还可以指定index的名字和列的名字

In [58]:
df.index.name = "city"
df.columns.name = "info"
df

info          apts      cars   income    expense  western
city
Beijing    55000.0  300000.0      NaN  5800000.0    False
Chongqing      NaN  150000.0  10000.0        NaN     True
Guangzhou  25000.0  200000.0  20000.0  2700000.0    False
Hangzhou   20000.0       NaN      NaN        NaN    False
Shanghai   60000.0  400000.0      NaN  6400000.0    False
Shenzhen   50000.0  300000.0  30000.0  5300000.0    False
Suzhou         0.0       0.0      NaN        0.0    False
Tianjin        NaN  200000.0      NaN        NaN    False

In [59]:
df.T

city     Beijing Chongqing Guangzhou Hangzhou Shanghai Shenzhen Suzhou Tianjin
info
apts       55000       NaN     25000    20000    60000    50000      0     NaN
cars      300000    150000    200000      NaN   400000   300000      0  200000
income       NaN     10000     20000      NaN      NaN    30000    NaN     NaN
expense  5.8e+06       NaN   2.7e+06      NaN  6.4e+06  5.3e+06      0     NaN
western    False      True     False    False    False    False  False   False

## 课后作业
- 研究一下pandas当中的broadcast是怎么用的，对比一下numpy中的broadcast
- 如何在pandas dataframe中加入一行

In [7]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [12]:
df.loc["Chongqing":"Hangzhou", ["apts", "income"]]

              apts  income
Chongqing      NaN   15000
Guangzhou  25000.0   15000
Hangzhou   20000.0   15000

In [14]:
df[2:5]

              apts      cars  income    expense
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0

In [15]:
df["cars"].isin([300000, 200000])

Beijing       True
Chongqing    False
Guangzhou     True
Hangzhou     False
Shanghai     False
Shenzhen      True
Suzhou       False
Tianjin       True
Name: cars, dtype: bool

In [16]:
df.isin([300000, 200000])

            apts   cars  income  expense
Beijing    False   True   False    False
Chongqing  False  False   False    False
Guangzhou  False   True   False    False
Hangzhou   False  False   False    False
Shanghai   False  False   False    False
Shenzhen   False   True   False    False
Suzhou     False  False   False    False
Tianjin    False   True   False    False

In [17]:
df == 300000

            apts   cars  income  expense
Beijing    False   True   False    False
Chongqing  False  False   False    False
Guangzhou  False  False   False    False
Hangzhou   False  False   False    False
Shanghai   False  False   False    False
Shenzhen   False   True   False    False
Suzhou     False  False   False    False
Tianjin    False  False   False    False

In [21]:
df.where(df["apts"] > 50000)

              apts      cars   income    expense
Beijing    55000.0  300000.0  15000.0  5800000.0
Chongqing      NaN       NaN      NaN        NaN
Guangzhou      NaN       NaN      NaN        NaN
Hangzhou       NaN       NaN      NaN        NaN
Shanghai   60000.0  400000.0  15000.0  6400000.0
Shenzhen       NaN       NaN      NaN        NaN
Suzhou         NaN       NaN      NaN        NaN
Tianjin        NaN       NaN      NaN        NaN

In [19]:
df["apts"] > 50000

Beijing       True
Chongqing    False
Guangzhou    False
Hangzhou     False
Shanghai      True
Shenzhen     False
Suzhou       False
Tianjin      False
Name: apts, dtype: bool

In [22]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [23]:
df.fillna(value=0)

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      0.0  150000.0   15000        0.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       0.0   15000        0.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         0.0       0.0   15000        0.0
Tianjin        0.0  200000.0   15000        0.0

In [24]:
df.fillna(method="ffill")

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  55000.0  150000.0   15000  5800000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  200000.0   15000  2700000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou     50000.0  300000.0   15000  5300000.0
Tianjin    50000.0  200000.0   15000  5300000.0

In [25]:
df.fillna(method="bfill")

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  25000.0  150000.0   15000  2700000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  400000.0   15000  6400000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN  200000.0   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [26]:
df.ffill()

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  55000.0  150000.0   15000  5800000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  200000.0   15000  2700000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou     50000.0  300000.0   15000  5300000.0
Tianjin    50000.0  200000.0   15000  5300000.0

In [27]:
df.bfill()

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing  25000.0  150000.0   15000  2700000.0
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0  400000.0   15000  6400000.0
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN  200000.0   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [29]:
row = df.loc["Guangzhou"]
row

apts         25000.0
cars        200000.0
income       15000.0
expense    2700000.0
Name: Guangzhou, dtype: float64

In [30]:
df

              apts      cars  income    expense
Beijing    55000.0  300000.0   15000  5800000.0
Chongqing      NaN  150000.0   15000        NaN
Guangzhou  25000.0  200000.0   15000  2700000.0
Hangzhou   20000.0       NaN   15000        NaN
Shanghai   60000.0  400000.0   15000  6400000.0
Shenzhen   50000.0  300000.0   15000  5300000.0
Suzhou         NaN       NaN   15000        NaN
Tianjin        NaN  200000.0   15000        NaN

In [38]:
df.sub(row, axis=1)

              apts      cars  income    expense
Beijing    30000.0  100000.0     0.0  3100000.0
Chongqing      NaN  -50000.0     0.0        NaN
Guangzhou      0.0       0.0     0.0        0.0
Hangzhou   -5000.0       NaN     0.0        NaN
Shanghai   35000.0  200000.0     0.0  3700000.0
Shenzhen   25000.0  100000.0     0.0  2600000.0
Suzhou         NaN       NaN     0.0        NaN
Tianjin        NaN       0.0     0.0        NaN

In [32]:
col = df["cars"]
col

Beijing      300000.0
Chongqing    150000.0
Guangzhou    200000.0
Hangzhou          NaN
Shanghai     400000.0
Shenzhen     300000.0
Suzhou            NaN
Tianjin      200000.0
Name: cars, dtype: float64

In [37]:
df.sub(col, axis=0)

               apts  cars    income    expense
Beijing   -245000.0   0.0 -285000.0  5500000.0
Chongqing       NaN   0.0 -135000.0        NaN
Guangzhou -175000.0   0.0 -185000.0  2500000.0
Hangzhou        NaN   NaN       NaN        NaN
Shanghai  -340000.0   0.0 -385000.0  6000000.0
Shenzhen  -250000.0   0.0 -285000.0  5000000.0
Suzhou          NaN   NaN       NaN        NaN
Tianjin         NaN   0.0 -185000.0        NaN